Repository: xiepixie/SparkleRecorder
Catalog: Sources/SparkleRecorder/Automation.xcstrings
Source language: en
Languages: zh_hans

source: Run History
zh_hans: 运行历史

source: Control how long run evidence and history remain on this Mac.
zh_hans: 设置运行证据和历史记录在这台 Mac 上的保留时间。

source: Successful run evidence
zh_hans: 成功运行的证据

source: Run evidence needing attention
zh_hans: 需处理运行的证据

source: Run history records
zh_hans: 运行历史记录

source: Evidence includes reports, ending screenshots, condition evidence, and other run files. When evidence expires, the run result stays in history until its history retention period ends.
zh_hans: 证据包括运行报告、结束截图、条件证据和其他运行文件。证据到期清理后，运行结果仍会保留在历史中，直到运行历史的保留期结束。

source: Automatic cleanup keeps active runs, the latest execution for each workflow, the latest run needing attention, and the latest evidence for each macro.
zh_hans: 自动清理会保留正在运行的任务、每个工作流最近一次执行、最近一次需要处理的运行，以及每个宏的最新证据。

source: Run history targets at most 10,000 records. Protected or active runs may temporarily exceed this limit. Choosing Never disables only the age limit.
zh_hans: 运行历史以最多 10,000 条记录为目标；受保护或正在运行的记录可能暂时超过该上限。选择“永不”只会停用按时间清理。

source: Clean up run history?
zh_hans: 清理运行历史？

source: This will remove evidence from %1$d run(s), delete %2$d old history record(s), and free about %3$@. Protected recent runs will stay available.
zh_hans: 将清理 %1$d 次运行的证据、删除 %2$d 条旧历史记录，预计释放 %3$@。受保护的近期运行仍会保留。

source: This will mark expired evidence from %1$d run(s) as cleaned and delete %2$d old history record(s). No local evidence files are currently taking space. Protected recent runs will stay available.
zh_hans: 将把 %1$d 次运行的过期证据标记为已清理，并删除 %2$d 条旧历史记录。当前没有这些证据对应的本地文件占用空间；受保护的近期运行仍会保留。

source: No expired run evidence or history to clean up.
zh_hans: 没有需要清理的过期运行证据或历史记录。

source: Run history cleanup check failed: %@
zh_hans: 运行历史清理检查失败：%@

source: Run history cleanup failed: %@
zh_hans: 运行历史清理失败：%@

# Cleaned up evidence from %d run(s) and removed %d old history record(s).
source: Cleaned up evidence from %1$d run(s) and removed %2$d old history record(s).
zh_hans: 已清理 %1$d 次运行的证据，并删除 %2$d 条旧历史记录。

source: Updated %1$d expired evidence record(s) and removed %2$d old history record(s). No local evidence files needed deletion.
zh_hans: 已更新 %1$d 条过期证据记录，并删除 %2$d 条旧历史记录；没有本地证据文件需要删除。

source: Evidence expired and was cleaned up. The run result and failure explanation remain available.
zh_hans: 证据到期后已清理，运行结果和失败说明仍然保留。

source: Evidence was cleaned up on %@. The run result and failure explanation remain available.
zh_hans: 证据已于 %@ 清理，运行结果和失败说明仍然保留。

source: %@, %d runs
zh_hans: %@，%d 次运行

source: All runs
zh_hans: 全部运行

source: Run ID
zh_hans: 运行 ID

source: What happened
zh_hans: 发生了什么

source: Recommended next step
zh_hans: 建议下一步

source: Run details
zh_hans: 运行详情

source: Playback was interrupted.
zh_hans: 回放已中断。

source: Playback was cancelled.
zh_hans: 回放已取消。

source: Playback was cancelled by the user.
zh_hans: 用户已取消回放。

source: Every step in this run completed successfully.
zh_hans: 本次运行的所有步骤均已成功完成。

source: This run ended before all steps completed.
zh_hans: 本次运行在所有步骤完成前已结束。

source: SparkleRecorder is tracking this run live. If the app closes, the run will be marked as interrupted when it reopens.
zh_hans: SparkleRecorder 正在实时跟踪本次运行。如果应用关闭，下次打开时会将本次运行标记为中断。

source: %@ sequence
zh_hans: %@ 序列

source: %d macros · %@
zh_hans: %d 个宏 · %@

source: Add at least one macro.
zh_hans: 请至少添加一个宏。

source: Add macro
zh_hans: 添加宏

source: Advanced edit…
zh_hans: 高级编辑…

source: Applications remain open after the sequence
zh_hans: 序列结束后应用仍保持打开

source: Continue immediately
zh_hans: 立即继续

source: Clear OCR area
zh_hans: 清除 OCR 区域

source: Could not create the sequence.
zh_hans: 无法创建序列。

source: Could not save the sequence.
zh_hans: 无法保存序列。

source: Each macro once
zh_hans: 每个宏完整运行一次

source: Draw area
zh_hans: 框选区域

source: Entire target screen
zh_hans: 整个目标屏幕

source: Enter the screen text to wait for.
zh_hans: 请输入要等待出现的屏幕文字。

source: Give the sequence a name.
zh_hans: 请为序列命名。

source: Manual only
zh_hans: 仅手动运行

source: Match
zh_hans: 匹配方式

source: Move earlier
zh_hans: 前移

source: Move later
zh_hans: 后移

source: New sequence
zh_hans: 新序列

source: Quick sequence
zh_hans: 快速序列

source: Pick from screen
zh_hans: 从屏幕取词

source: Remove step
zh_hans: 移除步骤

source: Save sequence
zh_hans: 保存序列

source: Save & test in 5 seconds
zh_hans: 保存并在 5 秒后试跑

source: Cancel test (%d)
zh_hans: 取消试跑（%d）

source: Starting test…
zh_hans: 正在开始试跑…

source: Sequence name
zh_hans: 序列名称

source: Sequence saved.
zh_hans: 序列已保存。

source: Sequence saved. Next run: %@
zh_hans: 序列已保存。下次运行：%@

source: Sequence saved. Test started.
zh_hans: 序列已保存，试跑已开始。

source: Sequence saved, but the test could not start.
zh_hans: 序列已保存，但无法开始试跑。

source: Text to find
zh_hans: 要查找的文字

source: Text wait timeouts must be greater than zero.
zh_hans: 文字等待超时必须大于零。

source: Then
zh_hans: 然后

source: Timing
zh_hans: 运行时间

source: Wait
zh_hans: 等待

source: Wait durations must be greater than zero.
zh_hans: 等待时间必须大于零。

source: Wait for a duration
zh_hans: 等待一段时间

source: Wait for screen text
zh_hans: 等待屏幕文字

source: Review Evidence
zh_hans: 查看证据

source: Review Failure
zh_hans: 查看失败详情

source: Run Again
zh_hans: 重新运行

source: Open Run History Settings
zh_hans: 打开运行历史设置

source: Cancel this execution?
zh_hans: 取消本次运行？

source: Every active step in this execution will be stopped. Completed steps and saved evidence will remain in history.
zh_hans: 本次运行中所有活动步骤都将停止。已完成步骤和已保存证据仍会保留在历史中。

source: Report only
zh_hans: 仅报告

source: Save failed
zh_hans: 保存失败

source: Not verified
zh_hans: 尚未验证

source: Report saved; screenshot unavailable
zh_hans: 报告已保存，截图不可用

source: Evidence save failed
zh_hans: 证据保存失败

source: No evidence recorded
zh_hans: 未记录证据

source: Evidence not verified
zh_hans: 证据尚未验证

source: Run evidence
zh_hans: 运行证据

source: Failed at event #%d
zh_hans: 在事件 #%d 处失败

source: The saved evidence files could not be found.
zh_hans: 找不到已保存的证据文件。

source: Evidence could not be opened.
zh_hans: 无法打开证据。

source: Stopped %d active step(s).
zh_hans: 已停止 %d 个活动步骤。

source: The run could not be stopped: %@
zh_hans: 无法停止本次运行：%@

source: A new run started.
zh_hans: 新的运行已开始。

source: The workflow could not start: %@
zh_hans: 无法启动工作流：%@

source: System Settings opened.
zh_hans: 已打开系统设置。

source: Stopped %d step(s); %d could not be stopped.
zh_hans: 已停止 %d 个步骤；%d 个步骤无法停止。

source: Wait for completion, or cancel every active step in this run.
zh_hans: 等待运行完成，或取消本次运行中的所有活动步骤。

source: AI Draft
zh_hans: AI 草稿

source: %d macros · %d steps
zh_hans: %d 个宏 · %d 个步骤

source: 1 macro
zh_hans: 1 个宏

source: All automations
zh_hans: 所有自动化

source: Automations
zh_hans: 自动化

source: Build Automation Sequence…
zh_hans: 创建线性自动化…

source: Change the search or status filter.
zh_hans: 调整搜索内容或状态筛选。

source: Create Automation
zh_hans: 创建自动化

source: Create Automation…
zh_hans: 创建自动化…

source: Create from Macro Library
zh_hans: 从宏库创建

source: Create one from a macro, then choose when it runs.
zh_hans: 从宏创建自动化，再设置运行时间。

source: Edit automation
zh_hans: 编辑自动化

source: New advanced workflow
zh_hans: 新建高级工作流

source: No automations
zh_hans: 暂无自动化

source: No matching automations
zh_hans: 没有匹配的自动化

source: Open Macro Library
zh_hans: 打开宏库

source: Open the workflow editor to preserve its advanced settings.
zh_hans: 请在工作流编辑器中打开，以保留高级设置。

source: Open the workflow editor to repair this automation.
zh_hans: 请在工作流编辑器中修复此自动化。

source: Sequence could not be opened
zh_hans: 无法打开线性自动化

source: Schedules / sequences
zh_hans: 定时与序列

source: Run now
zh_hans: 立即运行

source: Search automations
zh_hans: 搜索自动化

source: Sequence
zh_hans: 线性

source: Single macro
zh_hans: 单宏

source: %d executions
zh_hans: %d 次运行

source: All run history
zh_hans: 全部运行记录

source: Choose an automation to manage its schedule and runs.
zh_hans: 选择一个自动化以管理配置和运行记录。

source: Copy diagnostics
zh_hans: 复制诊断信息

source: Current status
zh_hans: 当前状态

source: Delete automation
zh_hans: 删除自动化

source: Delete automation “%@”?
zh_hans: 删除自动化“%@”？

source: Delete automation?
zh_hans: 删除自动化？

source: Diagnostics
zh_hans: 诊断证据

source: Execution ID
zh_hans: 运行 ID

source: No evidence
zh_hans: 无运行证据

source: Pause automation
zh_hans: 暂停自动化

source: Recent runs
zh_hans: 最近运行

source: Resume automation
zh_hans: 恢复自动化

source: Run this automation to create its first result and evidence record.
zh_hans: 运行此自动化后，这里会显示首次结果和运行证据。

source: Select an automation
zh_hans: 选择自动化

source: The automation configuration will be removed. Its macros and saved run history will remain.
zh_hans: 将删除自动化配置；其中使用的宏和已保存的运行记录会保留。

source: Add login or navigation macro
zh_hans: 添加登录或导航宏

source: No wait
zh_hans: 不等待

source: Open target application
zh_hans: 打开目标应用

source: Start preparation
zh_hans: 开始前准备

source: Use this for startup loading. If login or navigation is required, create a sequence with preparation macros.
zh_hans: 此等待用于应用启动加载；如果需要登录或进入指定页面，请创建包含准备宏的序列。

source: Wait after window appears
zh_hans: 窗口出现后等待

source: Automatic cleanup is off. Manual cleanup remains available.
zh_hans: 自动清理已关闭，仍可随时手动清理。

source: Automatic cleanup will check when the app is running.
zh_hans: 应用运行时将自动检查可清理内容。

source: Automatically manage run storage
zh_hans: 自动管理运行存储

source: Condition evidence
zh_hans: 条件证据

source: Delete Evidence
zh_hans: 删除证据

source: Delete evidence?
zh_hans: 删除证据？

source: Delete Run History
zh_hans: 删除运行记录

source: Delete Screenshots
zh_hans: 删除截图

source: Delete screenshots?
zh_hans: 删除截图？

source: Delete this run history?
zh_hans: 删除本次运行记录？

# Deleted %d run record(s) and associated evidence, freeing about %@.
source: Deleted %1$d run record(s) and associated evidence, freeing about %2$@.
zh_hans: 已删除 %1$d 条运行记录及关联证据，释放约 %2$@。

# Deleted evidence from %d run(s) and freed about %@.
source: Deleted evidence from %1$d run(s) and freed about %2$@.
zh_hans: 已删除 %1$d 条运行的证据，释放约 %2$@。

# Deleted screenshots from %d run(s) and freed about %@.
source: Deleted screenshots from %1$d run(s) and freed about %2$@.
zh_hans: 已删除 %1$d 条运行的截图，释放约 %2$@。

source: Evidence size
zh_hans: 证据占用

source: History index
zh_hans: 历史索引

# Last checked %@ · nothing expired · earliest next check %@
source: Last checked %1$@ · nothing expired · earliest next check %2$@
zh_hans: 上次检查 %1$@ · 没有到期内容 · 最早下次检查 %2$@

source: Last checked %1$@ · updated %2$d expired evidence record(s) and removed %3$d history record(s) · no local files to free · earliest next check %4$@
zh_hans: 上次检查 %1$@ · 更新 %2$d 条过期证据记录并删除 %3$d 条历史记录 · 没有本地文件需要释放 · 最早下次检查 %4$@

source: Last checked %1$@ · cleaned evidence from %2$d run(s) and removed %3$d history record(s) · freed %4$@ · earliest next check %5$@
zh_hans: 上次检查 %1$@ · 清理 %2$d 次运行的证据并删除 %3$d 条历史记录 · 释放 %4$@ · 最早下次检查 %5$@

source: Manage run data
zh_hans: 管理运行数据

source: Other evidence
zh_hans: 其他证据

source: Refresh storage usage
zh_hans: 刷新存储用量

source: Reports
zh_hans: 报告

source: Reports are still saved when screenshots are off or unavailable.
zh_hans: 关闭截图或截图不可用时，仍会保存运行报告。

source: Run data could not be deleted: %@
zh_hans: 无法删除运行数据：%@

source: Run records
zh_hans: 运行记录

source: Save ending screenshots
zh_hans: 保存结束截图

source: Screenshots
zh_hans: 截图

source: Ending screenshots use most of this storage. Turn off Save ending screenshots to reduce future growth; cleanup removes existing evidence only after its retention period expires.
zh_hans: 结束截图占用了大部分运行存储。关闭“保存结束截图”可以减少后续增长；现有证据只有达到设定保留期后才会被自动清理。

source: Storage usage could not be calculated: %@
zh_hans: 无法计算存储用量：%@

source: Storage used
zh_hans: 已用存储

# This permanently removes %d run record(s) and about %@ of associated evidence.
source: This permanently removes %1$d run record(s) and about %2$@ of associated evidence.
zh_hans: 这将永久删除 %1$d 条运行记录及约 %2$@ 的关联证据。

source: This removes about %@ of ending screenshots. Reports and run history stay available.
zh_hans: 这将删除约 %@ 的结束截图，报告和运行记录仍会保留。

source: This removes about %@ of reports, screenshots, and diagnostic evidence. A lightweight run record stays in history.
zh_hans: 这将删除约 %@ 的报告、截图和诊断证据，同时保留轻量运行记录。

source: Workflow Editor
zh_hans: 工作流编辑器

source: Could not find the target window for %@. Open it, or choose a different target window for this macro, then try again. No actions were run.
zh_hans: 找不到 %@ 的目标窗口。请先打开该窗口；如果窗口已经更换，请为这个宏重新选择目标窗口后再试。本次未执行任何操作。

source: Schedule & Frequency
zh_hans: 执行周期与时间

source: Upcoming Run & Summary
zh_hans: 下次执行与生效预览

source: Cleaned up %d expired visual evidence artifact(s) and %d bundle(s).
zh_hans: 已清理 %d 个过期视觉证据文件和 %d 个记录包。

source: Scheduled visual evidence cleanup failed: %@
zh_hans: 定期清理视觉证据失败：%@

source: This draft uses an unsupported workflow format.
zh_hans: 此草稿使用了当前不支持的工作流格式。

source: Give the workflow a name.
zh_hans: 请为工作流命名。

source: A task is missing its key.
zh_hans: 有一个任务缺少标识。

source: A task key is used more than once.
zh_hans: 存在重复的任务标识。

source: This task type is not supported.
zh_hans: 当前不支持这种任务类型。

source: Choose a macro for this task.
zh_hans: 请为此任务选择一个宏。

source: This macro reference matches more than one macro.
zh_hans: 这个宏引用匹配到多个宏，请明确选择一个。

source: Set a delay duration.
zh_hans: 请设置延迟时长。

source: Enter a valid duration greater than zero.
zh_hans: 请输入大于 0 的有效时长。

source: Configure a condition for this task.
zh_hans: 请为此任务配置条件。

source: This condition type is not supported.
zh_hans: 当前不支持这种条件类型。

source: Enter a notification title.
zh_hans: 请输入通知标题。

source: Choose both ends of this dependency.
zh_hans: 请同时指定这条依赖关系的起点和终点。

source: A task cannot depend on itself.
zh_hans: 任务不能依赖自身。

source: This dependency trigger is not supported.
zh_hans: 当前不支持这种依赖触发条件。

source: This dependency is already defined.
zh_hans: 这条依赖关系已存在。

source: This dependency would create a cycle.
zh_hans: 这条依赖关系会形成循环依赖。

source: Add a timeout branch for this condition.
zh_hans: 请为此条件添加超时分支。

source: Review this task's schedule settings.
zh_hans: 请检查此任务的定时设置。

source: Review this task's retry settings.
zh_hans: 请检查此任务的重试设置。

source: Review this task's join policy.
zh_hans: 请检查此任务的合并策略。

source: Review the target application policy.
zh_hans: 请检查目标应用的启动策略。

source: Review the target application cleanup policy.
zh_hans: 请检查目标应用的运行后处理策略。

source: Review the missed-run policy.
zh_hans: 请检查错过计划运行时的处理方式。

source: Review the loop settings.
zh_hans: 请检查循环设置。

source: Choose the visual reference required by this condition.
zh_hans: 请选择此条件需要使用的视觉参考。

source: Pick a target pixel.
zh_hans: 请选择目标像素。

source: Enter a threshold between 0 and 1.
zh_hans: 请输入 0 到 1 之间的阈值。

source: Enter a valid pixel sample radius.
zh_hans: 请输入有效的像素采样半径。

source: Choose a valid target color.
zh_hans: 请选择有效的目标颜色。

source: This region reference could not be resolved.
zh_hans: 无法解析这个区域引用。

source: A visual asset key is used more than once.
zh_hans: 存在重复的视觉资源标识。

source: Review this visual asset.
zh_hans: 请检查此视觉资源。

source: A referenced visual asset is missing.
zh_hans: 引用的视觉资源不存在。

source: Some workflow settings cannot be represented in this draft format.
zh_hans: 部分工作流设置无法完整表示为当前草稿格式。

source: This notification severity is not supported.
zh_hans: 当前不支持这种通知级别。

source: The compiled workflow did not pass validation.
zh_hans: 生成的工作流未通过校验。

source: Workflow changes could not be saved. Check available disk space and file permissions, then try again.
zh_hans: 工作流更改未能保存。请检查磁盘空间和文件权限后重试。

source: Run progress could not be saved. Check available disk space and file permissions before running again.
zh_hans: 本次运行进度未能保存。再次运行前，请检查磁盘空间和文件权限。

source: Run history could not be refreshed. Try again in a moment.
zh_hans: 无法刷新运行记录，请稍后重试。

source: The draft could not be updated. Review the edit and try again.
zh_hans: 未能更新草稿。请检查本次修改后重试。

source: Choose valid tasks for both ends of this dependency.
zh_hans: 请为这条依赖关系选择有效的起点和终点任务。

source: Choose a valid trigger for this dependency.
zh_hans: 请为这条依赖关系选择有效的触发条件。

source: The selected task is no longer in this draft.
zh_hans: 所选任务已不在当前草稿中。请刷新草稿后重试。

source: Choose a dependency before editing it.
zh_hans: 请先选择要编辑的依赖关系。

source: The selected dependency is no longer in this draft.
zh_hans: 所选依赖关系已不在当前草稿中。请刷新草稿后重试。

source: More than one dependency matches this edit. Choose one specific dependency.
zh_hans: 这次修改匹配到多条依赖关系。请明确选择其中一条。

source: This draft patch contains an unsupported change.
zh_hans: 此草稿补丁包含当前不支持的修改。

source: This draft patch is missing information required for the change.
zh_hans: 此草稿补丁缺少完成修改所需的信息。

source: The workflow draft could not be exported. Check the destination and try again.
zh_hans: 未能导出工作流草稿。请检查保存位置后重试。

source: The workflow was saved, but its visual assets could not be linked. Try importing again.
zh_hans: 工作流已保存，但未能关联视觉资源。请重新导入以完成关联。

source: Visual assets could not be linked
zh_hans: 未能关联视觉资源

source: The workflows were imported, but some visual assets could not be linked. Import the package again to retry the asset links.
zh_hans: 工作流已导入，但部分视觉资源未能关联。请重新导入该工作流包以重试资源关联。

source: Run history changed. Nothing needs cleanup now.
zh_hans: 运行历史已发生变化，目前无需清理。

source: Run history changed. Review the updated cleanup plan before deleting anything.
zh_hans: 运行历史已发生变化。删除前请重新确认更新后的清理方案。

source: Run storage usage could not be calculated: %@
zh_hans: 无法计算运行数据占用空间：%@

source: This removes ending screenshots. Reports and run history stay available. Storage size is currently unavailable.
zh_hans: 这会删除运行结束时的截图；报告和运行历史仍会保留。当前无法计算占用空间。

source: This removes reports, screenshots, and diagnostic evidence. A lightweight run record stays in history. Storage size is currently unavailable.
zh_hans: 这会删除报告、截图和诊断证据，但会保留精简的运行记录。当前无法计算占用空间。

source: This permanently removes %d run record(s) and their associated evidence. Storage size is currently unavailable.
zh_hans: 这会永久删除 %d 条运行记录及其关联证据。当前无法计算占用空间。

source: Workflow import failed and was rolled back: %@
zh_hans: 工作流导入失败，已撤销本次导入：%@

source: Workflow import failed, and some imported changes could not be rolled back: %@
zh_hans: 工作流导入失败，且部分已写入的更改未能撤销：%@

source: Storage size unavailable
zh_hans: 暂无法计算空间
